InformationRegisters/КоличествоЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЛидов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛидыНовыеВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыНовыеВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыЗаявкаНаЗамерВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыЗаявкаНаЗамерВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОтложенныеЗамерыВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОтложенныеЗамерыВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОтложенныеДоговорыВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОтложенныеДоговорыВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОформитьДоговорВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыДоговорОформленВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОбращениеВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОбращениеВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОтказныеВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыНецелевыеВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыВсеВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыРасчетДоЗамераВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыРасчетДоЗамераВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОбработкаПослеЗамераВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидыОбработкаПослеЗамераВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФлагАктуальности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЦентрСобытий/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		// если разворачивается новая база, параметр сеанса ТекущийПользователь еще не определен
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ОтображатьТолькоСвоиЛидыВСписке", ТекущийПользователь);
	ОтображатьТолькоСвоиЛиды = РеквизитыПользователя.ОтображатьТолькоСвоиЛидыВСписке;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//#16089
	ПодключитьОбработчикОжидания("РасчетКоличестваЛидовОбработчикОжидания", 5, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеЗаказа" Тогда
		// Параметр = МассивОснований = массив заказов

		МассивВыполненныхЗаказов = Новый Массив;
		Для каждого ЭлементМассива из Параметр Цикл
			СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПокупателей.Выполнен");
			Попытка
				СтатусЗаказа = СтатусЗаказаПокупателя(ЭлементМассива);
			Исключение
			КонецПопытки;
			Если СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПокупателей.ВРаботе") Тогда			
				ВсеТоварыПоЗаказуОтгружены = Ложь;
				Попытка
					ВсеТоварыПоЗаказуОтгружены = ВсеТоварыПоЗаказуОтгружены(ЭлементМассива);
				Исключение
				КонецПопытки;
				
				Если ВсеТоварыПоЗаказуОтгружены Тогда
					МассивВыполненныхЗаказов.Добавить(ЭлементМассива);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивВыполненныхЗаказов.Количество() > 0 Тогда
			Для каждого ЭлементМассива из МассивВыполненныхЗаказов Цикл
				
				ПроверкаОбъектЗаблокирован = ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЭлементМассива);
				Если НЕ ПроверкаОбъектЗаблокирован.Заблокирован Тогда
					// меняем незаблокированный заказ
					ИзменитьСтатусЗаказаПокупателяНаСервере(ЭлементМассива);				
				ИначеЕсли ПроверкаОбъектЗаблокирован.ЗаблокированВТекущемСеансе Тогда
					Оповестить("ЗакрытиеЗаказаОтЦентраСобытий", ЭлементМассива);
				Иначе
					// уведомляем пользователя , что заказы заблокированы кем-то другим
					ТекстСообщения = Строка(ЭлементМассива) + " полностью отгружен, но автоматически перевести его в статус ""Отгружен"" не удается, 
							|т.к. объект заблокирован пользователем " + ПроверкаОбъектЗаблокирован.ПользовательИДата + ". 
							|Вам следует перевести данный заказ покупателя в статус ""Отгружен"" вручную после того, как объект освободится.";
					Сообщить(ТекстСообщения);
					ПоказатьОповещениеПользователя("Внимание!",,ТекстСообщения,,СтатусОповещенияПользователя.Важное);
					ЗаписьЖурналаРегистрацииНаСервере("Данные.Изменение", ЭлементМассива, ТекстСообщения);
				КонецЕсли;
				
			КонецЦикла;
			
			// оповещаем АРМ для обновления списков
	        Оповестить("ОбновитьАРМПроизводства",,"РеализацияТоваровИУслуг");
		КонецЕсли;
		
	//#5545	
	ИначеЕсли ИмяСобытия = "ЦентрСобытий_ЗакрытиеМонтажа" Тогда
		// Параметр = Заказ-договор
		// Источник = Монтаж
		// попытка перевести Заказ-договор в статус Выполнен

		МассивВыполненныхЗаказов = Новый Массив;
		
		СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Выполнен");
		Попытка
			СтатусЗаказа = СтатусЗаказДоговора(Параметр);
		Исключение
		КонецПопытки;
		Если СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.ВРаботе") Тогда			
			ВсеТоварыПоЗаказДоговоруОтгружены = Ложь;
			Попытка
				ВсеТоварыПоЗаказДоговоруОтгружены = ВсеТоварыПоЗаказДоговоруОтгружены(Параметр);
			Исключение
			КонецПопытки;
			
			Если ВсеТоварыПоЗаказДоговоруОтгружены Тогда
				МассивВыполненныхЗаказов.Добавить(Параметр);
			КонецЕсли;
		КонецЕсли;
		
		Если МассивВыполненныхЗаказов.Количество() > 0 Тогда
			ОповеститьАРМ = Ложь;
			Для каждого ЭлементМассива из МассивВыполненныхЗаказов Цикл
				
				ПроверкаОбъектЗаблокирован = ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЭлементМассива);
				Если НЕ ПроверкаОбъектЗаблокирован.Заблокирован Тогда
					// меняем незаблокированный заказ
					ИзменитьСтатусЗаказДоговораНаСервере(ЭлементМассива);
					ОповеститьАРМ = Истина;
				ИначеЕсли ПроверкаОбъектЗаблокирован.ЗаблокированВТекущемСеансе Тогда
					Оповестить("ЗакрытиеЗаказДоговораОтЦентраСобытий", ЭлементМассива);
				Иначе
					// уведомляем пользователя, что заказы заблокированы кем-то другим
					ТекстСообщения = Строка(ЭлементМассива) + " полностью отгружен, но автоматически перевести его в статус ""Выполнен"" не удается, 
							|т.к. объект заблокирован пользователем " + ПроверкаОбъектЗаблокирован.ПользовательИДата + ". 
							|Вам следует перевести данный заказ в статус ""Выполнен"" вручную после того, как объект освободится.";
					Сообщить(ТекстСообщения);
					ПоказатьОповещениеПользователя("Внимание!",,ТекстСообщения,,СтатусОповещенияПользователя.Важное);
					ЗаписьЖурналаРегистрацииНаСервере("Данные.Изменение", ЭлементМассива, ТекстСообщения);
				КонецЕсли;
				
			КонецЦикла;
			
			// оповещаем АРМ для обновления списка заказов
			Если ОповеститьАРМ Тогда
	        	Оповестить("ОбновитьАРМРозницы",,"Монтаж");
			КонецЕсли;
		КонецЕсли;
		
	//#6303	
	ИначеЕсли ИмяСобытия = "ЦентрСобытий_РасторжениеЗаказДоговора" Тогда
		// Параметр = Заказ-договор или Массив Структур("СОРД, Заказ")
		// Источник = Соглашение о расторжении, Неопределено
		// попытка перевести Заказ-договор в статус Расторгнут
		МассивКРасторжению = Новый Массив; // готовим массив Структур("СОРД, Заказ")
		Если ТипЗнч(Параметр) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			//СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен");
			//Попытка
			//	СтатусЗаказа = СтатусЗаказДоговора(Параметр);
			//Исключение
			//КонецПопытки;
			СтатусЗаказа = СтатусЗаказДоговора(Параметр);
			Если НЕ СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда			
				МассивКРасторжению.Добавить(Новый Структура("СОРД, Заказ", Источник, Параметр));
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") Тогда	
			Для каждого ЭлементМассива из Параметр Цикл
				СтатусЗаказа = СтатусЗаказДоговора(ЭлементМассива.Заказ);
				Если НЕ СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен") Тогда			
					МассивКРасторжению.Добавить(ЭлементМассива);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если МассивКРасторжению.Количество() > 0 Тогда
			Для каждого ЭлементМассива из МассивКРасторжению Цикл				
				ПроверкаОбъектЗаблокирован = ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЭлементМассива.Заказ);
				Если НЕ ПроверкаОбъектЗаблокирован.Заблокирован Тогда
					// меняем незаблокированный заказ
					ИзменитьСтатусЗаказДоговораНаСервере(ЭлементМассива.Заказ, ПредопределенноеЗначение("Справочник.СтатусыЗаказДоговоров.Отменен"));
				ИначеЕсли ПроверкаОбъектЗаблокирован.ЗаблокированВТекущемСеансе Тогда
					Оповестить("РасторжениеЗаказДоговораОтЦентраСобытий", ЭлементМассива.Заказ, ЭлементМассива.СОРД);
				Иначе
					// уведомляем пользователя, что заказы заблокированы кем-то другим
					ТекстСообщения = Строка(ЭлементМассива.Заказ) + " не удается автоматически перевести его в статус ""Отменен"", 
							|т.к. объект заблокирован пользователем " + ПроверкаОбъектЗаблокирован.ПользовательИДата + ". 
							|Вам следует перевести данный заказ в статус ""Отменен"" вручную после того, как объект освободится.";
					Сообщить(ТекстСообщения);
					ПоказатьОповещениеПользователя("Внимание!",,ТекстСообщения,,СтатусОповещенияПользователя.Важное);
					ЗаписьЖурналаРегистрацииНаСервере("Данные.Изменение", ЭлементМассива.Заказ, ТекстСообщения);
				КонецЕсли;				
			КонецЦикла;			
		КонецЕсли;
		
	// №3172
	ИначеЕсли ИмяСобытия = "ЗакрытиеЗаказаПоставщику" Тогда
		// Параметр = Ссылка на заказ поставщику

		ЗаказСсылка = Параметр;
		СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПоставщику.Выполнен");
		
		Попытка
			СтатусЗаказа = СтатусЗаказаПоставщику(ЗаказСсылка);
		Исключение
		КонецПопытки;
		
		Если СтатусЗаказа = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПоставщику.ВРаботе") Тогда			
			
			ВсеТоварыПоЗаказуПоступили = Ложь;
			Попытка
				ВсеТоварыПоЗаказуПоступили = ВсеТоварыПоЗаказуПоставщикуПоступили(ЗаказСсылка);
			Исключение
			КонецПопытки;
			
			Если ВсеТоварыПоЗаказуПоступили Тогда
				
				ПроверкаОбъектЗаблокирован = ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЗаказСсылка);
				Если НЕ ПроверкаОбъектЗаблокирован.Заблокирован Тогда
					// меняем незаблокированный заказ
					ИзменитьСтатусЗаказаПоставщикуНаСервере(ЗаказСсылка);
				ИначеЕсли ПроверкаОбъектЗаблокирован.ЗаблокированВТекущемСеансе Тогда
					Оповестить("ЗакрытиеЗаказаПоставщикуОтЦентраСобытий", ЗаказСсылка);
				Иначе
					// уведомляем пользователя , что заказы заблокированы кем-то другим
					ТекстСообщения = Строка(ЗаказСсылка) + " полностью поступил, но автоматически перевести его в статус ""Выполнен"" не удается, 
					|т.к. объект заблокирован пользователем " + ПроверкаОбъектЗаблокирован.ПользовательИДата + ". 
					|Вам следует перевести данный заказ поставщику в статус ""Выполнен"" вручную после того, как объект освободится.";
					Сообщить(ТекстСообщения);
					ПоказатьОповещениеПользователя("Внимание!",, ТекстСообщения,, СтатусОповещенияПользователя.Важное);
					ЗаписьЖурналаРегистрацииНаСервере("Данные.Изменение", ЗаказСсылка, ТекстСообщения);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоЛидовПринудительно" Тогда
		// из АРМ розницы
		РасчетКоличестваЛидовОбработчикОжиданияКлиент(Истина);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаписьЖурналаРегистрацииНаСервере(Событие, Объект, Сообщение)
	
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Информация, Объект, Объект, Сообщение);
	
КонецПроцедуры

#Область РаботаСЗаказомПокупателя

&НаСервере
Функция СтатусЗаказаПокупателя(ЗаказСсылка)
	
	Возврат ЗаказСсылка.ТекущийСтатус;
	
КонецФункции

&НаСервере
Функция ВсеТоварыПоЗаказуОтгружены(ЗаказСсылка)
	
	СтруктураВозврата = Документы.ЗаказПокупателя.ВсеТоварыПоЗаказуОтгружены(ЗаказСсылка, ЗаказСсылка.Товары);
	Возврат	СтруктураВозврата.Результат;
	
КонецФункции
	
&НаСервере 
Процедура ИзменитьСтатусЗаказаПокупателяНаСервере(ВыполненныйЗаказ, УстановитьСтатус = Неопределено)
	
	Если УстановитьСтатус = Неопределено Тогда
		УстановитьСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ВыполненныйЗаказ);
	
	ОбщийМодульВызовСервера.ИзменитьСтатусЗаказовПокупателей(ЭтаФорма, МассивЗаказов, УстановитьСтатус, Ложь); 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЗаказДоговоромИСОРД

&НаСервере
Функция СтатусЗаказДоговора(ЗаказСсылка)
	
	//Возврат ЗаказСсылка.ТекущийСтатус;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказСсылка, "ТекущийСтатус");
	
КонецФункции

&НаСервере
Функция ВсеТоварыПоЗаказДоговоруОтгружены(ЗаказСсылка)

	СтруктураПроверки1 = Документы.ЗаказДоговор.ВсеТоварыПоЗаказуОтгружены1(ЗаказСсылка, ЗаказСсылка.ТоварыУслуги);
	СтруктураПроверки2 = Документы.ЗаказДоговор.ВсеТоварыПоЗаказуОтгружены2(ЗаказСсылка, ЗаказСсылка.ТоварыУслуги);
	Возврат СтруктураПроверки1.Результат И СтруктураПроверки2.Результат;
	
КонецФункции

&НаСервере 
Процедура ИзменитьСтатусЗаказДоговораНаСервере(ВыполненныйЗаказ, УстановитьСтатус = Неопределено)
	
	Если УстановитьСтатус = Неопределено Тогда
		УстановитьСтатус = Справочники.СтатусыЗаказДоговоров.Выполнен;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ВыполненныйЗаказ);
	
	ОбщийМодульВызовСервера.ИзменитьСтатусЗаказДоговоров(ЭтаФорма, МассивЗаказов, УстановитьСтатус, Ложь); 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЗаказомПоставщику

&НаСервере
Функция СтатусЗаказаПоставщику(ЗаказСсылка)
	
	Возврат ЗаказСсылка.ТекущийСтатус;
	
КонецФункции

&НаСервере
Функция ВсеТоварыПоЗаказуПоставщикуПоступили(ЗаказСсылка)
	
	Возврат Документы.ЗаказПоставщику.ВсеТоварыПоЗаказуПоступили(ЗаказСсылка);
	
КонецФункции
	
&НаСервере 
Процедура ИзменитьСтатусЗаказаПоставщикуНаСервере(ЗаказСсылка, УстановитьСтатус = Неопределено)
	
	Если УстановитьСтатус = Неопределено Тогда
		УстановитьСтатус = Справочники.СтатусыЗаказовПоставщику.Выполнен;
	КонецЕсли;
	
	ДокОбъект = ЗаказСсылка.ПолучитьОбъект();
	ДокОбъект.ТекущийСтатус = УстановитьСтатус;
	
	Попытка
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать();
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось перевести %1 в статус ""%2"": %3", ЗаказСсылка, УстановитьСтатус, ОписаниеОшибки());
		Сообщить(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РасчетКоличестваЛидов

&НаКлиенте
Процедура РасчетКоличестваЛидовОбработчикОжидания()
	
	РасчетКоличестваЛидовОбработчикОжиданияКлиент();
	
КонецПроцедуры
	
&НаКлиенте
Процедура РасчетКоличестваЛидовОбработчикОжиданияКлиент(Принудительно = Ложь)
		
	//#16089
	РезультатыСчетчиков = РасчетКоличестваЛидовОбработчикОжиданияСервер();
	
	ТребуетсяОповещение = Принудительно;
	Если НЕ РезультатыСчетчиков = Неопределено Тогда
		Если Принудительно
			ИЛИ НЕ ФлагАктуальностиПоКоличествуЛидов = РезультатыСчетчиков.ФлагАктуальности
			Тогда
			ФлагАктуальностиПоКоличествуЛидов = РезультатыСчетчиков.ФлагАктуальности;
			Оповестить("ОбновитьКнопкиАРМРозницы", РезультатыСчетчиков, "ЦентрСобытий");
		КонецЕсли;
		
	ИначеЕсли Принудительно Тогда
		РасчетКоличестваЛидовПринудительноСервер();
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция РасчетКоличестваЛидовОбработчикОжиданияСервер()
	
	МенеджерЗаписи = РегистрыСведений.КоличествоЛидов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Автор = ?(ОтображатьТолькоСвоиЛиды, ТекущийПользователь, Справочники.Пользователи.ПустаяСсылка());
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		СтруктураВозврата = Новый Структура("ФлагАктуальности, 
											|ЛидыНовыеВсего, ЛидыНовыеВРаботе, 
											|ЛидыЗаявкаНаЗамерВсего, ЛидыЗаявкаНаЗамерВРаботе,
											|ЛидыОтложенныеЗамерыВсего, ЛидыОтложенныеЗамерыВРаботе,
											//++ #16875 
											|ЛидыРасчетДоЗамераВРаботе, ЛидыРасчетДоЗамераВсего,
											|ЛидыОбработкаПослеЗамераВРаботе, ЛидыОбработкаПослеЗамераВсего,
											//-- #16875 
											|ЛидыОтложенныеДоговорыВсего, ЛидыОтложенныеДоговорыВРаботе,
											|ЛидыОформитьДоговорВсего,
											|ЛидыДоговорОформленВсего,
											|ЛидыОбращениеВсего, ЛидыОбращениеВРаботе,
											|ЛидыОтказныеВсего, ЛидыНецелевыеВсего,
											|ЛидыВсеВсего");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, МенеджерЗаписи);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РасчетКоличестваЛидовПринудительноСервер()

	ОбщийМодульСервер.ПроверитьЗапуститьФоновоеЗаданиеРасчетаКоличестваЛидов(Неопределено);
	
КонецФункции

#КонецОбласти
